CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/memory_manager/src/sli_memory_manager_common.c
/***************************************************************************//**
 * @file
 * @brief Memory Manager Driver Implementation.
 *******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stdalign.h>

#include "sl_memory_manager_config.h"
#include "sl_memory_manager.h"
#include "sli_memory_manager.h"
#include "sl_assert.h"
#include "sl_bit.h"
#include "sl_common.h"

#if defined(SL_COMPONENT_CATALOG_PRESENT)
#include "sl_component_catalog.h"
#endif

#if defined(SL_CATALOG_MEMORY_PROFILER_PRESENT)
#include "sl_memory_profiler.h"
#endif

/*******************************************************************************
 *********************************   DEFINES   *********************************
 ******************************************************************************/

// Minimum block alignment in bytes. 8 bytes is the minimum alignment to account for largest CPU data type
// that can be used in some block allocation scenarios. 64-bit data type may be used to manipulate the
// allocated block. The ARM processor ABI defines data types and byte alignment, and 8-byte alignment
// can be seen for the largest data object type.
#define SLI_BLOCK_ALLOC_MIN_ALIGN   SL_MEMORY_BLOCK_ALIGN_8_BYTES

// Minimum block allocation size to avoid creating a block too small while splitting up an allocated block.
// Minimum size is formed from (metadata + payload) size. Size expressed in bytes.
#define SLI_BLOCK_ALLOCATION_MIN_SIZE   (SLI_BLOCK_METADATA_SIZE_BYTE + SL_MEMORY_MANAGER_BLOCK_ALLOCATION_MIN_SIZE)

// 64-bit word size (in octets).
#define SLI_WORD_SIZE_64                8u

// Size of metadata area in different units.
#define SLI_BLOCK_METADATA_SIZE_BYTE    sizeof(sli_block_metadata_t)
#define SLI_BLOCK_METADATA_SIZE_DWORD   SLI_BLOCK_LEN_BYTE_TO_DWORD(SLI_BLOCK_METADATA_SIZE_BYTE)

/*******************************************************************************
 ***************************  LOCAL VARIABLES   ********************************
 ******************************************************************************/

sli_block_metadata_t *sli_free_lt_list_head;
sli_block_metadata_t *sli_free_st_list_head;
uint32_t sli_free_blocks_number;

#if defined(SLI_MEMORY_MANAGER_ENABLE_TEST_UTILITIES) || (defined(SL_CATALOG_MEMORY_PROFILER_PRESENT) && SL_MEMORY_PROFILER_SELECTION)
extern char __HeapBase[];
extern char __HeapLimit[];
#endif

#ifdef SLI_MEMORY_MANAGER_ENABLE_TEST_UTILITIES
// Dynamic reservation bookkeeping.
sl_memory_reservation_t *sli_reservation_handle_ptr_table[SLI_MAX_RESERVATION_COUNT] = { NULL };
uint32_t sli_reservation_alignment_table[SLI_MAX_RESERVATION_COUNT] = { 0 };

// Reservation no retention bookkeeping.
// Array of structs instead of pointers to avoid dynamic allocation for handle.
sl_memory_reservation_t sli_reservation_no_retention_table[SLI_MAX_RESERVATION_COUNT] = { 0 };
uint32_t sli_reservation_no_retention_alignment_table[SLI_MAX_RESERVATION_COUNT] = { 0 };
#endif

/*******************************************************************************
 ***************************   LOCAL FUNCTIONS   *******************************
 ******************************************************************************/

#ifdef SLI_MEMORY_MANAGER_ENABLE_TEST_UTILITIES
/***************************************************************************//**
 * Get the index in sli_reservation_handle_ptr_table by block address.
 *
 * @param[in]  addr  Pointer to block reservation.
 *
 * @return    Corresponding index in sli_reservation_handle_ptr_table.
 ******************************************************************************/
static uint32_t get_reservation_ix_by_addr(void *addr)
{
  for (uint32_t ix = 0; ix < SLI_MAX_RESERVATION_COUNT; ix++) {
    if (sli_reservation_handle_ptr_table[ix] == NULL) {
      continue;
    }
    if (sli_reservation_handle_ptr_table[ix]->block_address == addr) {
      return ix;
    }
  }
  return -1;
}

/***************************************************************************//**
 * Get the index in sli_reservation_handle_ptr_table
 * by reservation handle pointer.
 *
 * @param[in]  addr  Pointer to reservation handle.
 *
 * @return    Corresponding index in sli_reservation_handle_ptr_table.
 ******************************************************************************/
static uint32_t get_reservation_ix_by_handle(sl_memory_reservation_t *reservation_handle_ptr)
{
  for (uint32_t ix = 0; ix < SLI_MAX_RESERVATION_COUNT; ix++) {
    if (sli_reservation_handle_ptr_table[ix] == NULL) {
      continue;
    }
    if (sli_reservation_handle_ptr_table[ix] == reservation_handle_ptr) {
      return ix;
    }
  }
  return -1;
}

/***************************************************************************//**
 * Get an index of sli_reservation_handle_ptr_table that is free.
 *
 * @return    Index of an empty entry in sli_reservation_handle_ptr_table.
 ******************************************************************************/
static uint32_t get_available_reservation_handle_ix(void)
{
  for (uint32_t ix = 0; ix < SLI_MAX_RESERVATION_COUNT; ix++) {
    if (sli_reservation_handle_ptr_table[ix] == NULL) {
      return ix;
    }
  }
  return -1;
}

/***************************************************************************//**
 * Get the index in sli_reservation_no_retention_table by block address.
 *
 * @param[in]  addr  Pointer to block reservation.
 *
 * @return    Corresponding index in sli_reservation_no_retention_table.
 ******************************************************************************/
static uint32_t get_reservation_no_retention_ix(void *addr)
{
  for (uint32_t ix = 0; ix < SLI_MAX_RESERVATION_COUNT; ix++) {
    if (sli_reservation_no_retention_table[ix].block_address == NULL) {
      continue;
    }
    if (sli_reservation_no_retention_table[ix].block_address == addr) {
      return ix;
    }
  }
  return -1;
}

/***************************************************************************//**
 * Get an index of sli_reservation_no_retention_table that is free.
 *
 * @return    Index of an empty entry in sli_reservation_no_retention_table.
 ******************************************************************************/
static uint32_t get_available_reservation_no_retention_ix(void)
{
  for (uint32_t ix = 0; ix < SLI_MAX_RESERVATION_COUNT; ix++) {
    if (sli_reservation_no_retention_table[ix].block_address == NULL) {
      return ix;
    }
  }
  return -1;
}
#endif

/***************************************************************************//**
 * Initializes a memory block metadata to some reset values.
 ******************************************************************************/
void sli_memory_metadata_init(sli_block_metadata_t *block_metadata)
{
  block_metadata->block_in_use = 0;
  block_metadata->heap_start_align = 0;
  block_metadata->reserved = 0;
  block_metadata->length = 0;
  block_metadata->offset_neighbour_prev = 0;
  block_metadata->offset_neighbour_next = 0;
}

/***************************************************************************//**
 * Get pointer pointing to the first free block of adequate size.
 *
 * @note (1) For a block reservation, there's no metadata next to the
 *           reserved block. For this reason, when looking for a free block
 *           large enough to fit a new reserved block, the size of the metadata
 *           is counted in the available size of the free blocks.
 *
 * @note (2) For a short-term block, if the required data alignment is greater
 *           than 8 bytes, the found block size must account for the correct
 *           alignment of the block data payload. A series of computations is
 *           done starting from the end of the found block to determine the
 *           best data offset needed to align the data payload. The worst
 *           alignment (size_real + block_align) cannot be taken by default
 *           as it may imply loosing too many bytes in internal fragmentation
 *           due to the alignment requirement.
 ******************************************************************************/
size_t sli_memory_find_free_block(size_t size,
                                  size_t align,
                                  sl_memory_block_type_t type,
                                  bool block_reservation,
                                  sli_block_metadata_t **block)
{
  sli_block_metadata_t *current_block_metadata = NULL;
  void *data_payload = NULL;
  size_t size_adjusted = 0;
  size_t current_block_len;
  size_t block_align = (align == SL_MEMORY_BLOCK_ALIGN_DEFAULT) ? SLI_BLOCK_ALLOC_MIN_ALIGN : align;
  size_t data_payload_offset;
  bool is_aligned = false;

