CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/memory_manager/src/sli_memory_manager_common.c
  current_block_metadata = (type == BLOCK_TYPE_LONG_TERM) ? sli_free_lt_list_head : sli_free_st_list_head;
  if (current_block_metadata == NULL) {
    *block = NULL;
    return 0;
  }

  current_block_len = SLI_BLOCK_LEN_DWORD_TO_BYTE(current_block_metadata->length);

  // For a block reservation, add the metadata's size to the free blocks' available memory space. See Note #2.
  current_block_len += block_reservation ? SLI_BLOCK_METADATA_SIZE_BYTE : 0;

  // Try to find a block to allocate (first-fit).
  while (current_block_metadata != NULL) {
    if ((!current_block_metadata->block_in_use) && (current_block_len >= size)) {
      if (type == BLOCK_TYPE_LONG_TERM) {
        // Check alignment requested and ensure size of found block can accommodate worst case alignment.
        // For LT, alignment requirement can be verified here whether the block is split or not.
        data_payload = (void *)((uint8_t *)current_block_metadata + SLI_BLOCK_METADATA_SIZE_BYTE);
        is_aligned = SLI_ADDR_IS_ALIGNED(data_payload, block_align);
        data_payload_offset = (uintptr_t)data_payload % block_align;

        if (is_aligned || (current_block_len >= (size + data_payload_offset))) {
          // Compute remaining block size given an alignment handling or not.
          size_adjusted = is_aligned ? size : (size + data_payload_offset);
          break;
        }
      } else {
        if (block_align == SLI_BLOCK_ALLOC_MIN_ALIGN) {
          // If alignment is 8 bytes (default min alignment), take the requested adjusted size.
          size_adjusted = size;

          break;
        } else {
          // If non 8-byte alignment, search the more optimized size accounting for the required alignment. See Note #3.
          uint8_t *block_end = (uint8_t *)((uint64_t *)current_block_metadata + SLI_BLOCK_METADATA_SIZE_DWORD + current_block_metadata->length);

          data_payload = (void *)(block_end - size);
          data_payload = (void *)SLI_ALIGN_ROUND_DOWN(((uintptr_t)data_payload), block_align);
          size_adjusted = (size_t)(block_end - (uint8_t *)data_payload);

          if (current_block_len >= size_adjusted) {
            break;
          }
        }
      }
    }

    // Get next block.
    if (type == BLOCK_TYPE_LONG_TERM) {
      if (current_block_metadata->offset_neighbour_next == 0) {
        *block = NULL;
        return 0;  // End of heap. No block found.
      }
      // Long-term browsing direction goes from start to end of heap.
      current_block_metadata = (sli_block_metadata_t *)((uint64_t *)current_block_metadata + (current_block_metadata->offset_neighbour_next));
    } else {
      if (current_block_metadata->offset_neighbour_prev == 0) {
        *block = NULL;
        return 0;  // Start of heap. No block found.
      }
      // Short-term browsing direction goes from end to start of heap.
      current_block_metadata = (sli_block_metadata_t *)((uint64_t *)current_block_metadata - (current_block_metadata->offset_neighbour_prev));
    }

    current_block_len = SLI_BLOCK_LEN_DWORD_TO_BYTE(current_block_metadata->length);
    current_block_len += block_reservation ? SLI_BLOCK_METADATA_SIZE_BYTE : 0;
  }

  *block = current_block_metadata;
  return size_adjusted;
}

/***************************************************************************//**
 * Finds the next free block that will become the long-term or short-term head
 * pointer.
 ******************************************************************************/
sli_block_metadata_t *sli_memory_find_head_free_block(sl_memory_block_type_t type,
                                                      sli_block_metadata_t *block_start_from)
{
  sli_block_metadata_t *current_block_metadata = NULL;
  sli_block_metadata_t *free_block_metadata = NULL;
  bool search = true;

  if (block_start_from != NULL) {
    // Start searching from the given block.
    current_block_metadata = block_start_from;
  } else {
    // Start searching from heap start (long-term [LT]) or near heap end (short-term [ST]).
    // For ST, searching cannot start at the absolute heap end. So the ST head pointer is used as it points
    // to the last free block closest to the heap end.
    sl_memory_region_t heap_region = sl_memory_get_heap_region();

    current_block_metadata = (type == BLOCK_TYPE_LONG_TERM) ? (sli_block_metadata_t *)heap_region.addr : sli_free_st_list_head;
  }

  // Long-term block: find the first free block closest to the heap start.
  // Short-term block: find the first free block closest to the heap end.
  do {
    if (current_block_metadata->block_in_use == 0) {
      free_block_metadata = current_block_metadata;
      search = false;
    } else if ((type == BLOCK_TYPE_LONG_TERM) && (current_block_metadata->offset_neighbour_next != 0)) {
      current_block_metadata = (sli_block_metadata_t *)((uint64_t *)current_block_metadata + (current_block_metadata->offset_neighbour_next));
    } else if ((type == BLOCK_TYPE_SHORT_TERM) && (current_block_metadata->offset_neighbour_prev != 0)) {
      current_block_metadata = (sli_block_metadata_t *)((uint64_t *)current_block_metadata - (current_block_metadata->offset_neighbour_prev));
    } else {
      // LT or ST search should never reach this path as this function is called if there is at least 1 block free.
      EFM_ASSERT(0);
    }
  } while (search);

  return free_block_metadata;
}

/***************************************************************************//**
 * Get long-term head pointer pointing to the first free block.
 ******************************************************************************/
void *sli_memory_get_longterm_head_ptr(void)
{
  return (void *)sli_free_lt_list_head;
}

/***************************************************************************//**
 * Get short-term head pointer pointing to the first free block.
 ******************************************************************************/
void *sli_memory_get_shortterm_head_ptr(void)
{
  return (void *)sli_free_st_list_head;
}

