CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/memory_manager/src/sli_memory_manager_common.c
#ifdef SLI_MEMORY_MANAGER_ENABLE_TEST_UTILITIES
/***************************************************************************//**
 * Get the ptr to sl_memory_reservation_t by block address.
 ******************************************************************************/
sl_memory_reservation_t *sli_memory_get_reservation_handle_by_addr(void *addr)
{
  uint32_t reservation_ix;
  reservation_ix = get_reservation_ix_by_addr(addr);

  if (reservation_ix != (uint32_t)-1) {
    return sli_reservation_handle_ptr_table[reservation_ix];
  }

  return NULL;
}

/***************************************************************************//**
 * Get the size of a reservation by block address.
 ******************************************************************************/
uint32_t sli_memory_get_reservation_size_by_addr(void *addr)
{
  sl_memory_reservation_t * reservation_handle_ptr;
  reservation_handle_ptr = sli_memory_get_reservation_handle_by_addr(addr);

  if (reservation_handle_ptr != NULL) {
    return reservation_handle_ptr->block_size;
  }
  // Not a reservation, return 0 size.
  return 0;
}

/***************************************************************************//**
 * Get the alignment of a reservation by block address.
 ******************************************************************************/
uint32_t sli_memory_get_reservation_align_by_addr(void *addr)
{
  uint32_t reservation_ix = -1;
  reservation_ix = get_reservation_ix_by_addr(addr);

  if (reservation_ix != (uint32_t)-1) {
    return sli_reservation_alignment_table[reservation_ix];
  }

  return 0;
}

/***************************************************************************//**
 * Bookkeep a reservation for profiling purposes.
 ******************************************************************************/
sl_status_t sli_memory_save_reservation_handle(sl_memory_reservation_t *reservation_handle_ptr, uint32_t align)
{
  uint32_t reservation_ix = -1;
  reservation_ix = get_available_reservation_handle_ix();

  if (reservation_ix != (uint32_t)-1) {
    sli_reservation_handle_ptr_table[reservation_ix] = reservation_handle_ptr;
    sli_reservation_alignment_table[reservation_ix] = align;
    return SL_STATUS_OK;
  } else {
    return SL_STATUS_FULL;
  }
}

/***************************************************************************//**
 * Remove a reservation from records.
 ******************************************************************************/
sl_status_t sli_memory_remove_reservation_handle(sl_memory_reservation_t *reservation_handle_ptr)
{
  uint32_t reservation_ix = -1;
  reservation_ix = get_reservation_ix_by_handle(reservation_handle_ptr);

  if (reservation_ix != (uint32_t)-1) {
    sli_reservation_handle_ptr_table[reservation_ix] = NULL;
    sli_reservation_alignment_table[reservation_ix] = 0;
    return SL_STATUS_OK;
  } else {
    return SL_STATUS_NOT_FOUND;
  }
}

/***************************************************************************//**
 * Bookkeep a reservation for profiling purposes.
 ******************************************************************************/
sl_status_t sli_memory_save_reservation_no_retention(void * block_address, uint32_t block_size, uint32_t align)
{
  uint32_t reservation_ix = -1;
  reservation_ix = get_available_reservation_no_retention_ix();

  if (reservation_ix != (uint32_t)-1) {
    sli_reservation_no_retention_table[reservation_ix].block_address = block_address;
    sli_reservation_no_retention_table[reservation_ix].block_size = block_size;
    sli_reservation_no_retention_alignment_table[reservation_ix] = align;

    return SL_STATUS_OK;
  } else {
    return SL_STATUS_FULL;
  }
}

/***************************************************************************//**
 * Get the size of a reservation (no retention) by block address.
 ******************************************************************************/
uint32_t sli_memory_get_reservation_no_retention_size(void * addr)
{
  uint32_t reservation_ix = -1;
  reservation_ix = get_reservation_no_retention_ix(addr);

  if (reservation_ix != (uint32_t)-1) {
    return sli_reservation_no_retention_table[reservation_ix].block_size;
  }
  // Not a reservation (no retention), return 0 size.
  return 0;
}

/***************************************************************************//**
 * Get the alignment of a reservation (no retention) by block address.
 ******************************************************************************/
uint32_t sli_memory_get_reservation_no_retention_align(void * addr)
{
  uint32_t reservation_ix = -1;
  reservation_ix = get_reservation_no_retention_ix(addr);

  if (reservation_ix != (uint32_t)-1) {
    return sli_reservation_no_retention_alignment_table[reservation_ix];
  }

  return 0;
}

/***************************************************************************//**
 * Do a heap integrity check forwards from sli_free_lt_list_head and return
 * the ptr to the corrupted sli_block_metadata_t (if applicable).
 * This could go past reservations so there are checks.
 ******************************************************************************/
sli_block_metadata_t *sli_memory_check_heap_integrity_forwards(void)
{
  uint64_t * heap_end_by_metadata = 0;
  uint32_t is_corrupted = 0;
  uint32_t reservation_size;
  uint32_t reservation_size_real;
  uint32_t alignment;
  sli_block_metadata_t* current = sli_free_lt_list_head;

  while (current != NULL) {
    // Reached last block in heap.
    if (current->offset_neighbour_next == 0) {
      heap_end_by_metadata = ((uint64_t *)current + (current->length + SLI_BLOCK_METADATA_SIZE_DWORD));

      // Check if reservation (one or more).
      alignment  = sli_memory_get_reservation_align_by_addr((void *)heap_end_by_metadata);
      reservation_size = sli_memory_get_reservation_size_by_addr((void *)heap_end_by_metadata);
      if (alignment == SL_MEMORY_BLOCK_ALIGN_DEFAULT) {
        reservation_size_real = reservation_size;
      } else {
        reservation_size_real = SLI_ALIGN_ROUND_UP(reservation_size, alignment);
      }

