CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/memory_manager/src/sli_memory_manager_common.c
      while (reservation_size != 0) {
        heap_end_by_metadata = (uint64_t *)((uint8_t*)heap_end_by_metadata + reservation_size_real);
        alignment  = sli_memory_get_reservation_align_by_addr((void *)heap_end_by_metadata);
        reservation_size = sli_memory_get_reservation_size_by_addr((void *)heap_end_by_metadata);
        if (alignment == SL_MEMORY_BLOCK_ALIGN_DEFAULT) {
          reservation_size_real = reservation_size;
        } else {
          reservation_size_real = SLI_ALIGN_ROUND_UP(reservation_size, alignment);
        }
      }

      // Check if reservation no retention (one or more).
      // Only needed for forwards.
      alignment  = sli_memory_get_reservation_no_retention_align((void *)heap_end_by_metadata);
      reservation_size = sli_memory_get_reservation_no_retention_size((void *)heap_end_by_metadata);
      if (alignment == SL_MEMORY_BLOCK_ALIGN_DEFAULT) {
        reservation_size_real = reservation_size;
      } else {
        reservation_size_real = SLI_ALIGN_ROUND_UP(reservation_size, alignment);
      }

      while (reservation_size != 0) {
        heap_end_by_metadata = (uint64_t *)((uint8_t*)heap_end_by_metadata + reservation_size_real);
        alignment  = sli_memory_get_reservation_no_retention_align((void *)heap_end_by_metadata);
        reservation_size = sli_memory_get_reservation_no_retention_size((void *)heap_end_by_metadata);
        if (alignment == SL_MEMORY_BLOCK_ALIGN_DEFAULT) {
          reservation_size_real = reservation_size;
        } else {
          reservation_size_real = SLI_ALIGN_ROUND_UP(reservation_size, alignment);
        }
      }

      if (heap_end_by_metadata != (void *)__HeapLimit) {
        is_corrupted = 1;
      }
      break;
    }

    // Calculate the address of the next block using offset and length.
    sli_block_metadata_t *next_blk_by_offset = (sli_block_metadata_t *)((uint64_t *)current + (current->offset_neighbour_next));
    sli_block_metadata_t *next_blk_by_len = (sli_block_metadata_t *)((uint64_t *)current + (current->length + SLI_BLOCK_METADATA_SIZE_DWORD));

    // Check if reservation (one or more).
    alignment  = sli_memory_get_reservation_align_by_addr((void *)next_blk_by_len);
    reservation_size = sli_memory_get_reservation_size_by_addr((void *)next_blk_by_len);
    if (alignment == SL_MEMORY_BLOCK_ALIGN_DEFAULT) {
      reservation_size_real = reservation_size;
    } else {
      reservation_size_real = SLI_ALIGN_ROUND_UP(reservation_size, alignment);
    }

    while (reservation_size != 0) {
      next_blk_by_len = (sli_block_metadata_t *)((uint8_t*)next_blk_by_len + reservation_size_real);
      alignment  = sli_memory_get_reservation_align_by_addr((void *)next_blk_by_len);
      reservation_size = sli_memory_get_reservation_size_by_addr((void *)next_blk_by_len);
      if (alignment == SL_MEMORY_BLOCK_ALIGN_DEFAULT) {
        reservation_size_real = reservation_size;
      } else {
        reservation_size_real = SLI_ALIGN_ROUND_UP(reservation_size, alignment);
      }
    }

    // Check if reservation no retention (one or more).
    // Only needed for forwards.
    alignment  = sli_memory_get_reservation_no_retention_align((void *)next_blk_by_len);
    reservation_size = sli_memory_get_reservation_no_retention_size((void *)next_blk_by_len);
    if (alignment == SL_MEMORY_BLOCK_ALIGN_DEFAULT) {
      reservation_size_real = reservation_size;
    } else {
      reservation_size_real = SLI_ALIGN_ROUND_UP(reservation_size, alignment);
    }

    while (reservation_size != 0) {
      next_blk_by_len = (sli_block_metadata_t *)((uint8_t*)next_blk_by_len + reservation_size_real);
      alignment  = sli_memory_get_reservation_no_retention_align((void *)next_blk_by_len);
      reservation_size = sli_memory_get_reservation_no_retention_size((void *)next_blk_by_len);
      if (alignment == SL_MEMORY_BLOCK_ALIGN_DEFAULT) {
        reservation_size_real = reservation_size;
      } else {
        reservation_size_real = SLI_ALIGN_ROUND_UP(reservation_size, alignment);
      }
    }

    if (next_blk_by_offset != next_blk_by_len) {
      is_corrupted = 1;
      break;
    } else {
      current = next_blk_by_offset;
    }
  }

  if (is_corrupted) {
    return (sli_block_metadata_t *)current;
  }

  return NULL;
}

/***************************************************************************//**
 * Do a heap integrity check backwards from sli_free_st_list_head and return
 * the ptr to the corrupted sli_block_metadata_t (if applicable).
 * This should not go past any reservations, hence there are no checks.
 ******************************************************************************/
sli_block_metadata_t *sli_memory_check_heap_integrity_backwards(void)
{
  uint64_t * heap_base_by_metadata = 0;
  uint32_t is_corrupted = 0;
  uint32_t reservation_size;
  uint32_t reservation_size_real;
  uint32_t alignment;
  sli_block_metadata_t* current = sli_free_st_list_head;

  while (current != NULL) {
    // Reached first block in heap.
    if (current->offset_neighbour_prev == 0) {
      heap_base_by_metadata = ((uint64_t *)current);
      if (heap_base_by_metadata != (void *)__HeapBase) {
        is_corrupted = 1;
      }
      break;
    }

    // Calculate the address of the current block using offset and length of the previous block.
    sli_block_metadata_t *prev_blk_by_offset = (sli_block_metadata_t *)((uint64_t *)current - (current->offset_neighbour_prev));
    sli_block_metadata_t *current_by_prev_offset = (sli_block_metadata_t *)((uint64_t *)prev_blk_by_offset + (prev_blk_by_offset->offset_neighbour_next));
    sli_block_metadata_t *current_by_prev_len = (sli_block_metadata_t *)((uint64_t *)prev_blk_by_offset + (prev_blk_by_offset->length + SLI_BLOCK_METADATA_SIZE_DWORD));

    // Check if reservation (one or more).
    // This is required when sli_free_st_list_head has reservations before it.
    alignment  = sli_memory_get_reservation_align_by_addr((void *)current_by_prev_len);
    reservation_size = sli_memory_get_reservation_size_by_addr((void *)current_by_prev_len);
    if (alignment == SL_MEMORY_BLOCK_ALIGN_DEFAULT) {
      reservation_size_real = reservation_size;
    } else {
      reservation_size_real = SLI_ALIGN_ROUND_UP(reservation_size, alignment);
    }

    while (reservation_size != 0) {
      current_by_prev_len = (sli_block_metadata_t *)((uint8_t*)current_by_prev_len + reservation_size_real);
      alignment  = sli_memory_get_reservation_align_by_addr((void *)current_by_prev_len);
      reservation_size = sli_memory_get_reservation_size_by_addr((void *)current_by_prev_len);
      if (alignment == SL_MEMORY_BLOCK_ALIGN_DEFAULT) {
        reservation_size_real = reservation_size;
      } else {
        reservation_size_real = SLI_ALIGN_ROUND_UP(reservation_size, alignment);
      }
    }

    if (current_by_prev_len != current_by_prev_offset) {
      is_corrupted = 1;
      break;
    } else {
      current = prev_blk_by_offset;
    }
  }

  if (is_corrupted) {
    return (sli_block_metadata_t *)current;
  }

  return NULL;
}
#endif /* SLI_MEMORY_MANAGER_ENABLE_TEST_UTILITIES */
